# AreaVolumeSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaVolumeSettings Class
Members See Also
---
This class provides access to settings related to volume and area computations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class AreaVolumeSettings : Element
```

Visual Basic
---
```text
Public Class AreaVolumeSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class AreaVolumeSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..AreaVolumeSettings
# See Also
AreaVolumeSettings Members
Autodesk.Revit.DB Namespace